
fn main() {
    let машина = Машина {
        название: String::from("bmw"),
        размер_колёс: 100
    };

    let автобус = Автобус {
        количество_пассажиров: 50,
        скорость: 67
    };

    водить_транспорт(машина);
    водить_транспорт(автобус);
}

fn водить_транспорт<Т: Транспорт>(транспорт: Т) {
    транспорт.водить();
    транспорт.сломаться();    
}

trait Транспорт {
    fn водить(&self);
    fn сломаться(&self);
}

struct Машина {
    размер_колёс: u8,
    название: String,
}

impl Транспорт for Машина {
    fn водить(&self) {
        println!("водим машину!!!!");
    }

    fn сломаться(&self) {
        println!("машина сломалась!!!!!!");
    }
}

struct Автобус {
    количество_пассажиров: u8,
    скорость: u8
}


impl Транспорт for Автобус {
    fn водить(&self) {
        println!("водим Автобус!!!!");
    }

    fn сломаться(&self) {
        println!("Автобус сломалась!!!!!!");
    }
}